Website/app/controllers/homes_controller.rb

INSERT INTO "homes" ("title", "description", "image_url", "contact_info", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @home = Home.new(home_params)

    respond_to do |format|
      if @home.save

UPDATE "homes" SET "image_url" = ?, "updated_at" = ? WHERE "homes"."id" = ?  [["image_url", "https://www.facebook.com/photo.php?fbid=10203478240668215&set=t.1579405217&type=3&theater"], ["updated_at", "2018-05-23 17:04:51.820870"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @home.update(home_params)